witalis3/UA3REO-DDC-Transceiver/STM32/Src/settings.c
#include "settings.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <stdlib.h>
#include "functions.h"
#include "trx_manager.h"
#include "lcd.h"
#include "fpga.h"
#include "main.h"
#include "bands.h"
#include "front_unit.h"

char version_string[19] = "2.2.4"; //1.2.3-yymmdd.hhmm (concatinate)

//W25Q16
static uint8_t Write_Enable = W25Q16_COMMAND_Write_Enable;
static uint8_t Sector_Erase = W25Q16_COMMAND_Sector_Erase;
static uint8_t Page_Program = W25Q16_COMMAND_Page_Program;
static uint8_t Read_Data = W25Q16_COMMAND_Read_Data;
static uint8_t Power_Down = W25Q16_COMMAND_Power_Down;
static uint8_t Get_Status = W25Q16_COMMAND_GetStatus;
static uint8_t Power_Up = W25Q16_COMMAND_Power_Up;

static uint8_t Address[3] = {0x00};
struct TRX_SETTINGS TRX;
struct TRX_CALIBRATE CALIBRATE = {0};
static uint8_t settings_bank = 1;

IRAM2 static uint8_t write_clone[sizeof(TRX)] = {0};
IRAM2 static uint8_t read_clone[sizeof(TRX)] = {0};
IRAM2 static uint8_t verify_clone[sizeof(TRX)] = {0};

volatile bool NeedSaveSettings = false;
volatile bool NeedSaveCalibration = false;
volatile bool EEPROM_Busy = false;
static bool EEPROM_Enabled = true;

static void LoadSettingsFromEEPROM(void);
static bool EEPROM_Sector_Erase(uint8_t sector, bool force);
static bool EEPROM_Write_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verify, bool force);
static bool EEPROM_Read_Data(uint8_t *Buffer, uint16_t size, uint8_t sector, bool verif, bool force);
static void EEPROM_PowerDown(void);
static void EEPROM_PowerUp(void);
static void EEPROM_WaitWrite(void);
static uint8_t calculateCSUM(void);
static uint8_t calculateCSUM_EEPROM(void);

const char *MODE_DESCR[TRX_MODE_COUNT] = {
	"LSB",
	"USB",
	"CW-L",
	"CW-U",
	"NFM",
	"WFM",
	"AM",
	"DIGL",
	"DIGU",
	"IQ",
	"LOOP",
	"NOTX",
};

void InitSettings(void)
{
	static bool already_inited = false;
	if (already_inited)
		return;
	already_inited = true;

	//concat build date to version -yymmdd.hhmm
	uint8_t cur_len = (uint8_t)strlen(version_string);
	strcat(version_string, "-");
	version_string[++cur_len] = BUILD_YEAR_CH2;
	version_string[++cur_len] = BUILD_YEAR_CH3;
	version_string[++cur_len] = BUILD_MONTH_CH0;
	version_string[++cur_len] = BUILD_MONTH_CH1;
	version_string[++cur_len] = BUILD_DAY_CH0;
	version_string[++cur_len] = BUILD_DAY_CH1;
	version_string[++cur_len] = '.';
	version_string[++cur_len] = BUILD_HOUR_CH0;
	version_string[++cur_len] = BUILD_HOUR_CH1;
	version_string[++cur_len] = BUILD_MIN_CH0;
	version_string[++cur_len] = BUILD_MIN_CH1;
	version_string[++cur_len] = '\0';
	sendToDebug_strln(version_string);
}

void LoadSettings(bool clear)
{
	BKPSRAM_Enable();
	memcpy(&TRX, BACKUP_SRAM_BANK1_ADDR, sizeof(TRX));
	// Check, the data in the backup sram is correct, otherwise we use the second bank
	if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
	{
		memcpy(&TRX, BACKUP_SRAM_BANK2_ADDR, sizeof(TRX));
		if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
		{
			sendToDebug_strln("[ERR] BACKUP SRAM data incorrect");

			LoadSettingsFromEEPROM();
			if (TRX.ENDBit != 100 || TRX.flash_id != SETT_VERSION || TRX.csum != calculateCSUM())
			{
				sendToDebug_strln("[ERR] EEPROM Settings data incorrect");
			}
			else
			{
				sendToDebug_strln("[OK] Settings data succesfully loaded from EEPROM");
			}
		}
		else
		{
			sendToDebug_strln("[OK] Settings data succesfully loaded from BACKUP SRAM bank 2");
		}
	}
	else
	{
		sendToDebug_strln("[OK] Settings data succesfully loaded from BACKUP SRAM bank 1");
	}
	BKPSRAM_Disable();

	if (TRX.flash_id != SETT_VERSION || clear || TRX.ENDBit != 100 || TRX.csum != calculateCSUM()) // code to trace new clean flash
	{
		if (clear)
			sendToDebug_strln("[OK] Soft reset TRX");
		memset(&TRX, 0x00, sizeof(TRX));
		TRX.flash_id = SETT_VERSION;		 // Firmware ID in SRAM, if it doesn't match, use the default
		TRX.VFO_A.Freq = 7100000;			 // stored VFO-A frequency
		TRX.VFO_A.Mode = TRX_MODE_LSB;		 // saved VFO-A mode
		TRX.VFO_A.LPF_Filter_Width = 2700;	 // saved bandwidth for VFO-A
		TRX.VFO_A.HPF_Filter_Width = 60;	 // saved bandwidth for VFO-A
		TRX.VFO_A.ManualNotchFilter = false; // notch filter to cut out noise
		TRX.VFO_A.AutoNotchFilter = false;	 // notch filter to cut out noise
		TRX.VFO_A.NotchFC = 1000;			 // cutoff frequency of the notch filter
		TRX.VFO_A.DNR_Type = 0;				 // digital noise reduction
		TRX.VFO_A.AGC = true;				 // AGC
		TRX.VFO_A.FM_SQL_threshold = 4;			 // FM noise reduction
		TRX.VFO_B.Freq = 14150000;			 // stored VFO-B frequency
		TRX.VFO_B.Mode = TRX_MODE_USB;		 // saved VFO-B mode
		TRX.VFO_B.LPF_Filter_Width = 2700;	 // saved bandwidth for VFO-B
		TRX.VFO_B.HPF_Filter_Width = 60;	 // saved bandwidth for VFO-B
		TRX.VFO_B.ManualNotchFilter = false; // notch filter to cut out noise
		TRX.VFO_B.AutoNotchFilter = false;	 // notch filter to cut out noise
		TRX.VFO_B.NotchFC = 1000;			 // cutoff frequency of the notch filter
		TRX.VFO_A.DNR_Type = 0;				 // digital noise reduction
		TRX.VFO_A.AGC = true;				 // AGC
		TRX.VFO_B.FM_SQL_threshold = 4;			 // FM noise reduction
		TRX.current_vfo = false;			 // current VFO (false - A)
		TRX.ADC_Driver = true;				 // preamplifier (ADC driver)
		TRX.LNA = false;					 // LNA (Low Noise Amplifier)
		TRX.ATT = false;					 // attenuator
		TRX.ATT_DB = 12.0f;					 // suppress the attenuator
		TRX.ATT_STEP = 6.0f;				 // step of tuning the attenuator
		TRX.Fast = true;					 // accelerated frequency change when the encoder rotates
		TRX.ADC_PGA = true;					 // ADC preamp
		TRX.ANT = false;					 // ANT-1
		TRX.FM_SQL_threshold = 4;
		for (uint8_t i = 0; i < BANDS_COUNT; i++)
		{
			TRX.BANDS_SAVED_SETTINGS[i].Freq = BANDS[i].startFreq + (BANDS[i].endFreq - BANDS[i].startFreq) / 2; // saved frequencies by bands
			TRX.BANDS_SAVED_SETTINGS[i].Mode = (uint8_t)getModeFromFreq(TRX.BANDS_SAVED_SETTINGS[i].Freq);
			TRX.BANDS_SAVED_SETTINGS[i].LNA = TRX.LNA;
			TRX.BANDS_SAVED_SETTINGS[i].ATT = TRX.ATT;
			TRX.BANDS_SAVED_SETTINGS[i].ATT_DB = TRX.ATT_DB;
			TRX.BANDS_SAVED_SETTINGS[i].ANT = TRX.ANT;
			TRX.BANDS_SAVED_SETTINGS[i].ADC_Driver = TRX.ADC_Driver;
			TRX.BANDS_SAVED_SETTINGS[i].FM_SQL_threshold = TRX.VFO_A.FM_SQL_threshold;
			TRX.BANDS_SAVED_SETTINGS[i].ADC_PGA = TRX.ADC_PGA;
			TRX.BANDS_SAVED_SETTINGS[i].DNR_Type = 0;
			TRX.BANDS_SAVED_SETTINGS[i].AGC = true;
			TRX.BANDS_SAVED_SETTINGS[i].AutoGain_Stage = 6;
		}
		TRX.RF_Filters = true; // LPF / HPF / BPF
#ifdef LAY_800x480
		TRX.FFT_Zoom = 1;	// approximation of the FFT spectrum
		TRX.FFT_ZoomCW = 8; // zoomfft for cw mode
#else
		TRX.FFT_Zoom = 2;	// approximation of the FFT spectrum
		TRX.FFT_ZoomCW = 8; // zoomfft for cw mode
#endif
		TRX.AutoGain = false;	  // auto-control preamp and attenuator
		TRX.CWDecoder = false;	  // automatic telegraph decoder
		TRX.InputType_MIC = true; // type of input to transfer
		TRX.InputType_LINE = false;
		TRX.InputType_USB = false;
		TRX.CW_LPF_Filter = 1000;					 // default value of CW filter width
		TRX.CW_HPF_Filter = 0;						 // default value of CW filter width
		TRX.SSB_LPF_Filter = 2700;					 // default value of SSB filter width
		TRX.SSB_HPF_Filter = 300;					 // default value of SSB filter width
		TRX.AM_LPF_Filter = 4000;					 // default value of AM filter width
		TRX.FM_LPF_Filter = 10000;					 // default value of the FM filter width
		TRX.RF_Power = 20;							 //output power (%)
		TRX.RX_AGC_SSB_speed = 10;					 // AGC receive rate on SSB
		TRX.RX_AGC_CW_speed = 1;					 // AGC receive rate on CW
		TRX.TX_AGC_speed = 3;						 // AGC transfer rate
		TRX.BandMapEnabled = true;					 // automatic change of mode according to the range map
		TRX.FFT_Enabled = true;						 // use FFT spectrum
		TRX.CW_GENERATOR_SHIFT_HZ = 500;			 // LO offset in CW mode
		TRX.CW_Key_timeout = 200;					 // time of releasing transmission after the last character on the key
		TRX.FFT_Averaging = 4;						 // averaging the FFT to make it smoother
		TRX.WIFI_Enabled = true;					 // activate WiFi
		strcpy(TRX.WIFI_AP1, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD1, "WIFI-PASSWORD"); // password to the WiFi point 1
		strcpy(TRX.WIFI_AP2, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD2, "WIFI-PASSWORD"); // password to the WiFi point 2
		strcpy(TRX.WIFI_AP3, "WIFI-AP");			 // WiFi hotspot
		strcpy(TRX.WIFI_PASSWORD3, "WIFI-PASSWORD"); // password to the WiFi point 3
		TRX.WIFI_TIMEZONE = 3;						 // time zone (for time synchronization)
		TRX.SPEC_Begin = 1000;						 // start spectrum analyzer range
		TRX.SPEC_End = 30000;						 // end of spectrum analyzer range
		TRX.SPEC_TopDBM = -60;						 // chart thresholds
		TRX.SPEC_BottomDBM = -130;					 // chart thresholds
		TRX.CW_SelfHear = true;						 // self-control CW
		TRX.ADC_RAND = true;						 // ADC encryption (xor randomizer)
		TRX.ADC_SHDN = false;						 // ADC disable
		TRX.ADC_DITH = false;						 // ADC dither
		TRX.FFT_Window = 1;
		TRX.Locked = false;				  // Lock control
		TRX.CLAR = false;				  // Split frequency mode (receive one VFO, transmit another)
		TRX.TWO_SIGNAL_TUNE = false;	  // Two-signal generator in TUNE mode (1 + 2kHz)
		TRX.IF_Gain = 70;				  // IF gain, dB (before all processing and AGC)
		TRX.CW_KEYER = true;			  // Automatic key
		TRX.CW_KEYER_WPM = 30;			  // Automatic key speed
		TRX.Debug_Console = false;		  // Debug output to DEBUG / UART port
		TRX.Dual_RX = false;			  //Dual RX feature
		TRX.Dual_RX_Type = VFO_A_PLUS_B;  // dual receiver mode
		TRX.FFT_Style = 1;				  // FFT style
		TRX.FFT_Color = 1;				  // FFT display color
		TRX.FFT_Height = 2;				  // FFT display height
		TRX.FFT_Grid = 1;				  // FFT grid style
		TRX.FFT_Lens = false;			  //FFT lens effect
		TRX.FFT_3D = 0;					  //FFT 3D mode
		TRX.FFT_Sensitivity = 8;				  //Threshold of FFT autocalibrate
		TRX.WTF_Moving = true;			  //move WTF with frequency encoder
		TRX.ShiftEnabled = false;		  // activate the SHIFT mode
		TRX.SHIFT_INTERVAL = 1000;		  // Detune range with the SHIFT knob (5000 = -5000hz / + 5000hz)
		TRX.DNR_SNR_THRESHOLD = 50;		  // Digital noise reduction level
		TRX.DNR_AVERAGE = 2;			  // DNR averaging when looking for average magnitude
		TRX.DNR_MINIMAL = 99;			  // DNR averaging when searching for minimum magnitude
		TRX.NOISE_BLANKER = true;		  // suppressor of short impulse noise NOISE BLANKER
		TRX.FRQ_STEP = 10;				  // frequency tuning step by the main encoder
		TRX.FRQ_FAST_STEP = 100;		  // frequency tuning step by the main encoder in FAST mode
		TRX.FRQ_ENC_STEP = 25000;		  // frequency tuning step by main add. encoder
		TRX.FRQ_ENC_FAST_STEP = 50000;	  // frequency tuning step by main add. encoder in FAST mode
		TRX.AGC_GAIN_TARGET = -30;		  // Maximum (target) AGC gain
		TRX.WIFI_CAT_SERVER = false;		  // Server for receiving CAT commands via WIFI
		TRX.MIC_GAIN = 3;				  // Microphone gain
		TRX.RX_EQ_LOW = 0;				  // Receiver Equalizer (Low)
		TRX.RX_EQ_MID = 0;				  // Receiver EQ (mids)
		TRX.RX_EQ_HIG = 0;				  // Receiver EQ (high)
		TRX.MIC_EQ_LOW = 0;				  // Mic EQ (Low)
		TRX.MIC_EQ_MID = 0;				  // Mic Equalizer (Mids)
		TRX.MIC_EQ_HIG = 0;				  // Mic EQ (high)
		TRX.MIC_REVERBER = 0;			  // Mic Reveerber
		TRX.FFT_Speed = 3;				  // FFT Speed
		TRX.Beeper = true;				  //Keyboard beeper
		TRX.FFT_Background = true;		  //FFT gradient background
		TRX.VAD_Squelch = false;		  //SSB Squelch on VAD technology
		TRX.FFT_Compressor = true;		  //Compress FFT Peaks
		TRX.Encoder_Accelerate = true;	  //Accelerate Encoder on fast rate
		strcpy(TRX.CALLSIGN, "HamRad");	  // Callsign
		strcpy(TRX.LOCATOR, "LO02RR");	  // Locator
		TRX.ColorThemeId = 0;			  //Selected Color theme
		TRX.LayoutThemeId = 0;			  //Selected Layout theme
		TRX.Transverter_Enabled = false;  //Enable transverter mode
		TRX.Transverter_Offset_Mhz = 120; //Offset from VFO
		TRX.CW_GaussFilter = false;		  //Gauss responce LPF filter
		TRX.WSPR_FREQ_OFFSET = 0;		  //offset beacon from creq center
		TRX.WSPR_BANDS_160 = false;		  //enabled WSPR bands
		TRX.WSPR_BANDS_80 = true;
		TRX.WSPR_BANDS_40 = true;
		TRX.WSPR_BANDS_30 = true;
		TRX.WSPR_BANDS_20 = true;
		TRX.WSPR_BANDS_17 = true;
		TRX.WSPR_BANDS_15 = true;
		TRX.WSPR_BANDS_12 = true;
		TRX.WSPR_BANDS_10 = true;
		TRX.WSPR_BANDS_6 = false;
		TRX.WSPR_BANDS_2 = false;
		for (uint8_t i = 0; i < FUNCBUTTONS_COUNT; i++)
			TRX.FuncButtons[i] = i;
		TRX.LCD_Brightness = 60; //LCD Brightness

		TRX.ENDBit = 100; // Bit for the end of a successful write to eeprom
		sendToDebug_strln("[OK] Loaded default settings");
		LCD_showError("Loaded default settings", true);
		SaveSettings();
		SaveSettingsToEEPROM();
	}
}

